app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT * FROM `contacts`

  def send_mail
    #Add contact details to DB and send email
    @contact = Contact.new(params[:email])
    if @contact.save
---
INSERT INTO `contacts` (`name`, `message`, `updated_at`, `contactnumber`, `emailaddress`, `created_at`) VALUES('Gilbert', 'Test', '2011-02-22 15:56:26', 'gilbertliddell@hotmail.com', 'gilbertliddell@hotmail.com', '2011-02-22 15:56:26')