app/controllers/music_controller.rb

SELECT * FROM `songs` GROUP BY decade ORDER BY sortorder
---
  def index
    @song_headers = Song.all(:order => "id", :group => "decade")